In [1]:
import pandas as pd

In [4]:
train = pd.read_csv("data/train.csv", index_col="id")
train.shape

(381109, 11)

In [7]:
test = pd.read_csv("data/test.csv", index_col="id")
test.shape

(127037, 10)

In [11]:
train.head()

,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,Response
id,,,,,,,,,,,
1,Male,44,1,28.0,0,> 2 Years,Yes,40454.0,26.0,217,1
2,Male,76,1,3.0,0,1-2 Year,No,33536.0,26.0,183,0
3,Male,47,1,28.0,0,> 2 Years,Yes,38294.0,26.0,27,1
4,Male,21,1,11.0,1,< 1 Year,No,28619.0,152.0,203,0
5,Female,29,1,41.0,1,< 1 Year,No,27496.0,152.0,39,0

In [12]:
test.head()

,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage
id,,,,,,,,,,
381110,Male,25,1,11.0,1,< 1 Year,No,35786.0,152.0,53
381111,Male,40,1,28.0,0,1-2 Year,Yes,33762.0,7.0,111
381112,Male,47,1,28.0,0,1-2 Year,Yes,40050.0,124.0,199
381113,Male,24,1,27.0,1,< 1 Year,Yes,37356.0,152.0,187
381114,Male,27,1,28.0,1,< 1 Year,No,59097.0,152.0,297

In [10]:
set(train.columns) - set(test.columns)

{'Response'}

In [14]:
df = pd.concat([train, test])
df.shape

(508146, 11)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 508146 entries, 1 to 508146
Data columns (total 11 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   Gender                508146 non-null  object
 1   Age                   508146 non-null  int64
 2   Driving_License       508146 non-null  int64
 3   Region_Code           508146 non-null  float64
 4   Previously_Insured    508146 non-null  int64
 5   Vehicle_Age           508146 non-null  object
 6   Vehicle_Damage        508146 non-null  object
 7   Annual_Premium        508146 non-null  float64
 8   Policy_Sales_Channel  508146 non-null  float64
 9   Vintage               508146 non-null  int64
 10  Response              381109 non-null  float64
dtypes: float64(4), int64(4), object(3)
memory usage: 46.5+ MB

In [16]:
df.Gender.value_counts()

Male      274325
Female    233821
Name: Gender, dtype: int64

In [17]:
pd.crosstab(train["Gender"], train["Response"])

Response       0      1
Gender
Female    156835  18185
Male      177564  28525

In [19]:
pd.crosstab(train["Gender"], train["Response"], normalize=True) * 100

Response          0         1
Gender
Female    41.152269  4.771601
Male      46.591395  7.484735